In [1]:

#using dictionaries 
person = {
    "first": "Corey",
    "last": "Schafer",
    "email": "CoreyMSchafer@gmail.com"
}

In [2]:
import pandas as pd
import numpy as np

In [3]:
# a dictionary for people
people = {
    "first": ["Corey"],
    "last": ["Schafer"],
    "email": ["CoreyMSchafer@gmail.com"]
}

In [4]:
people = {
    "first" : ["Corey", 'Jane', 'John','Adam', np.nan, None, 'NA'],
    "last": ["Schafer", 'Doe', 'Doe', 'Doe', np.nan, np.nan, 'Missing'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com','AdamDoe@email.com', None, np.nan, 'Missing'],
    "age": ['33', '55', '63', '36', None, None, 'Missing']
}

In [5]:
people['email']

['CoreyMSchafer@gmail.com',
 'JaneDoe@email.com',
 'JohnDoe@email.com',
 'AdamDoe@email.com',
 None,
 nan,
 'Missing']

In [6]:
people['first']

['Corey', 'Jane', 'John', 'Adam', nan, None, 'NA']

In [7]:
people['last']

['Schafer', 'Doe', 'Doe', 'Doe', nan, nan, 'Missing']

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace = True)
df.replace('Missing', np.nan, inplace = True)

In [10]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3   Adam      Doe        AdamDoe@email.com    36
4    NaN      NaN                     None  None
5   None      NaN                      NaN  None
6    NaN      NaN                      NaN   NaN

In [11]:
#dropping na values
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3   Adam      Doe        AdamDoe@email.com  36

In [12]:
#index = rows
df.dropna(axis = 'index', how = 'all', subset = ['last','email'])

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3   Adam      Doe        AdamDoe@email.com  36

In [13]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4   True   True   True   True
5   True   True   True   True
6   True   True   True   True

In [14]:
df.fillna(0)

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3   Adam      Doe        AdamDoe@email.com  36
4      0        0                        0   0
5      0        0                        0   0
6      0        0                        0   0

In [15]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [16]:
type(np.nan)

float

In [17]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3   Adam      Doe        AdamDoe@email.com    36
4    NaN      NaN                     None  None
5   None      NaN                      NaN  None
6    NaN      NaN                      NaN   NaN

In [18]:
df['age'] = df['age'].astype(float)

In [19]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [20]:
df['age'].mean()

46.75

In [21]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
3          AdamDoe@email.com
4                       None
5                        NaN
6                        NaN
Name: email, dtype: object

In [22]:
df['first']

0    Corey
1     Jane
2     John
3     Adam
4      NaN
5     None
6      NaN
Name: first, dtype: object

In [23]:
df['last']

0    Schafer
1        Doe
2        Doe
3        Doe
4        NaN
5        NaN
6        NaN
Name: last, dtype: object

In [24]:
type(df['email'])

pandas.core.series.Series

In [25]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
3          AdamDoe@email.com
4                       None
5                        NaN
6                        NaN
Name: email, dtype: object

In [26]:
#Accessing Multiple Columns
df[['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com
3      Doe        AdamDoe@email.com
4      NaN                     None
5      NaN                      NaN
6      NaN                      NaN

In [27]:
df[['first','email']]

   first                    email
0  Corey  CoreyMSchafer@gmail.com
1   Jane        JaneDoe@email.com
2   John        JohnDoe@email.com
3   Adam        AdamDoe@email.com
4    NaN                     None
5   None                      NaN
6    NaN                      NaN

In [28]:
df.columns

Index(['first', 'last', 'email', 'age'], dtype='object')

In [29]:
#accessing the first row
df.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
age                         33.0
Name: 0, dtype: object

In [30]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
age                   63.0
Name: 2, dtype: object

In [31]:
df.iloc[[0,1]]

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33.0
1   Jane      Doe        JaneDoe@email.com  55.0

In [32]:
df.iloc[[0,1],0]

0    Corey
1     Jane
Name: first, dtype: object

In [33]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33.0
1   Jane      Doe        JaneDoe@email.com  55.0
2   John      Doe        JohnDoe@email.com  63.0
3   Adam      Doe        AdamDoe@email.com  36.0
4    NaN      NaN                     None   NaN
5   None      NaN                      NaN   NaN
6    NaN      NaN                      NaN   NaN

In [34]:
df.loc[[0,1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [35]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33.0
1   Jane      Doe        JaneDoe@email.com  55.0
2   John      Doe        JohnDoe@email.com  63.0
3   Adam      Doe        AdamDoe@email.com  36.0
4    NaN      NaN                     None   NaN
5   None      NaN                      NaN   NaN
6    NaN      NaN                      NaN   NaN

In [36]:
#accessing email
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
3          AdamDoe@email.com
4                       None
5                        NaN
6                        NaN
Name: email, dtype: object

In [37]:
df.set_index('email',inplace=True)

In [38]:
df.index

Index(['CoreyMSchafer@gmail.com',       'JaneDoe@email.com',
             'JohnDoe@email.com',       'AdamDoe@email.com',
                            None,                       nan,
                             nan],
      dtype='object', name='email')

In [39]:
df.loc['CoreyMSchafer@gmail.com','last']

'Schafer'

In [40]:
df.iloc[0]

first      Corey
last     Schafer
age         33.0
Name: CoreyMSchafer@gmail.com, dtype: object

In [41]:
df.reset_index(inplace=True)
df

                     email  first     last   age
0  CoreyMSchafer@gmail.com  Corey  Schafer  33.0
1        JaneDoe@email.com   Jane      Doe  55.0
2        JohnDoe@email.com   John      Doe  63.0
3        AdamDoe@email.com   Adam      Doe  36.0
4                     None    NaN      NaN   NaN
5                      NaN   None      NaN   NaN
6                      NaN    NaN      NaN   NaN

In [42]:
filt = (df['last']== 'Schafer') | (df['first']== 'John')

In [43]:
df.loc[~filt, 'email']

1    JaneDoe@email.com
3    AdamDoe@email.com
4                 None
5                  NaN
6                  NaN
Name: email, dtype: object

In [44]:
df

                     email  first     last   age
0  CoreyMSchafer@gmail.com  Corey  Schafer  33.0
1        JaneDoe@email.com   Jane      Doe  55.0
2        JohnDoe@email.com   John      Doe  63.0
3        AdamDoe@email.com   Adam      Doe  36.0
4                     None    NaN      NaN   NaN
5                      NaN   None      NaN   NaN
6                      NaN    NaN      NaN   NaN

In [45]:
df.columns

Index(['email', 'first', 'last', 'age'], dtype='object')

In [46]:
df.columns = ['email', 'first_name', 'last_name']

ValueError: Length mismatch: Expected axis has 4 elements, new values have 3 elements

In [ ]:
df

In [ ]:
df.columns = [x.lower() for x in df.columns]

In [ ]:
df

In [ ]:
df.rename(columns={'first_name':'first', 'last_name':'last'},inplace = True)

In [ ]:
df

In [ ]:
# grabbing John Doe and changing its last name
df.loc[2]= ['JohnDoe@email.com', 'John', 'Doe']

In [ ]:
df

In [ ]:
df.loc[2, ['last', 'email']]

In [ ]:
df.loc[1, ['first', 'email']]

In [ ]:
df.loc[2, 'last'] = 'Smith'

In [ ]:
df

In [ ]:
df.at[2, 'last'] = 'Doe'

In [ ]:
df

In [ ]:
filt = (df['email'] == 'JohnDoe@email.com')

In [ ]:
df.loc[filt, 'last'] = 'Smith'

In [ ]:
df

In [ ]:
# changing the email addresses to lowercase
df['email']= df['email'].str.lower()

In [ ]:
df

In [ ]:
df['first']=df['first'].str.lower()

In [ ]:
df

In [ ]:
# working with:
#apply
#map
#applymap
#replace

In [ ]:
# working with apply
df['email'].apply(len)

In [ ]:
def update_email(email):
    return email.upper()

In [ ]:
df['email'].apply(update_email)

In [ ]:
df['email'] = df['email'].apply(update_email)

In [ ]:
df['last'].apply(len)

In [ ]:
df

In [ ]:
#Using Lambda Function
df['email'] = df['email'].apply(lambda x : x.lower())

In [ ]:
df

In [ ]:
# Using 'apply' in Series
df['email'].apply(len)

In [ ]:
# Using 'apply' in the Dataframe
df.apply(len)

In [ ]:
len(df['email'])

In [ ]:
len(df['last'])

In [ ]:
df.apply(len, axis='columns')

In [ ]:
df.apply(pd.Series.min)

In [ ]:
# Using Lambda Functions as Alternative
df.apply(lambda x : x.min())

In [ ]:
# Using applymap method
#applymap only applies for DataFrame
df.map(len)

In [ ]:
#changing all the values in df to lowercase
df.map(str.lower)

In [ ]:
#Using the map method
#map only works in Series
df['first'].map({'corey':'chris', 'jane':'mary'})

In [ ]:
#Using replace method
df['first']= df['first'].replace({'corey':'chris', 'jane':'mary'})

In [ ]:
df

In [ ]:
df['first']+ ' ' +df['last']

In [ ]:
df['full_name'] = df['first']+ ' ' +df['last']

In [ ]:
df

In [ ]:
#remove columns: 'first' and 'last'
df.drop(columns = ['first', 'last'],inplace = True)

In [ ]:
df

In [ ]:
#reverse
df['full_name'].str.split(' ', expand = True)

In [ ]:
#adding columns : first and last
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)

In [ ]:
df

In [ ]:
people = {
    "first" : ["Corey", 'Jane'],
    "last": ["Schafer", 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com']
}
df2 = pd.DataFrame(people)

In [ ]:
df2

In [ ]:
df2.drop(index=1)

In [ ]:
#sorting
#sorting by last name 
df.sort_values(by = 'last')

In [ ]:
#sort in descending order
df.sort_values(by = 'last', ascending = False)

In [ ]:
#sorting first and last name
df.sort_values(by = ['last', 'first', 'email'], ascending = False)

In [ ]:
df.sort_values(by = ['last', 'first', 'email'], ascending = [False, True, False])

In [ ]:
df.sort_index()

In [ ]:
df['last'].sort_values()

In [ ]:
df